Split 3 stage training
